ref(post): convert ascii diagrams to mermaid
